Revit 2026 API

# FabricationConfigurationCanUnloadItemFiles Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanUnloadItemFiles(
	IList<FabricationItemFile> itemFiles
)
```
```vb
Public Function CanUnloadItemFiles (
	itemFiles As IList(Of FabricationItemFile)
) As Boolean
```
```cpp
public:
bool CanUnloadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
```
```fsharp
member CanUnloadItemFiles :
        itemFiles : IList<FabricationItemFile> -> bool
```

#### Parameters

itemFiles IListFabricationItemFile

#### Return Value

Boolean

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace